Blog/app/controllers/categories_controller.rb

  def show
    # @category = Category.find(params[:id])

    # respond_to do |format|
    #   format.html # show.html.erb
    #   format.json { render json: @category }
    # end

    @category = Category.find(params[:id])
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]