Blog/app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
---
	def index
		# @content_first = "This is some sample text for My Ruby Blog";
		# @content_second = "This is additional sample text for My Ruby Blog";

		#instance variable to print Posts in an array
		@posts = Post.all

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
	def show
		#get the id from the url and check in the database
		@post = Post.find(params[:id]);